HloModule jit_train_step, is_scheduled=true, input_output_alias={ {0}: (0, {}, may-alias), {1}: (1, {}, may-alias), {2}: (2, {}, may-alias), {3}: (3, {}, may-alias), {4}: (4, {}, may-alias), {5}: (5, {}, may-alias), {6}: (6, {}, may-alias), {7}: (7, {}, may-alias), {8}: (8, {}, may-alias), {9}: (9, {}, may-alias), {10}: (10, {}, may-alias), {11}: (11, {}, may-alias), {12}: (12, {}, may-alias), {13}: (13, {}, may-alias), {14}: (14, {}, may-alias), {15}: (15, {}, may-alias), {16}: (16, {}, may-alias), {17}: (17, {}, may-alias), {18}: (18, {}, may-alias), {19}: (19, {}, may-alias), {20}: (20, {}, may-alias), {21}: (21, {}, may-alias), {22}: (22, {}, may-alias), {23}: (23, {}, may-alias), {24}: (24, {}, may-alias), {25}: (25, {}, may-alias), {26}: (26, {}, may-alias), {27}: (27, {}, may-alias), {28}: (28, {}, may-alias), {29}: (29, {}, may-alias), {30}: (30, {}, may-alias), {31}: (31, {}, may-alias), {32}: (32, {}, may-alias), {33}: (33, {}, may-alias), {34}: (34, {}, may-alias), {35}: (35, {}, may-alias), {36}: (36, {}, may-alias), {37}: (37, {}, may-alias), {38}: (38, {}, may-alias) }, entry_computation_layout={(s32[]{:T(128)}, f32[4096]{0:T(1024)}, f32[4096,4,14336]{2,1,0:T(4,128)}, f32[4096,4,14336]{2,1,0:T(4,128)}, f32[14336,4,4096]{2,1,0:T(4,128)}, /*index=5*/f32[4096,4]{0,1:T(4,128)}, f32[4096,4]{0,1:T(4,128)}, f32[4096,4,8,128]{3,2,1,0:T(8,128)}, f32[32,4,128,4096]{3,2,1,0:T(8,128)}, f32[4096,4,32,128]{3,2,1,0:T(8,128)}, /*index=10*/f32[4096,4,8,128]{3,2,1,0:T(8,128)}, f32[4096,128256]{1,0:T(8,128)}, f32[128256,4096]{1,0:T(8,128)}, s32[]{:T(128)}, f32[4096]{0:T(1024)}, /*index=15*/f32[4096,4,14336]{2,1,0:T(4,128)}, f32[4096,4,14336]{2,1,0:T(4,128)}, f32[14336,4,4096]{2,1,0:T(4,128)}, f32[4096,4]{0,1:T(4,128)}, f32[4096,4]{0,1:T(4,128)}, /*index=20*/f32[4096,4,8,128]{3,2,1,0:T(8,128)}, f32[32,4,128,4096]{3,2,1,0:T(8,128)}, f32[4096,4,32,128]{3,2,1,0:T(8,128)}, f32[4096,4,8,128]{3,2,1,0:T(8,128)}, f32[4096,128256]{1,0:T(8,128)}, /*index=25*/f32[128256,4096]{1,0:T(8,128)}, f32[4096]{0:T(1024)}, f32[4096,4,14336]{2,1,0:T(4,128)}, f32[4096,4,14336]{2,1,0:T(4,128)}, f32[14336,4,4096]{2,1,0:T(4,128)}, /*index=30*/f32[4096,4]{0,1:T(4,128)}, f32[4096,4]{0,1:T(4,128)}, f32[4096,4,8,128]{3,2,1,0:T(8,128)}, f32[32,4,128,4096]{3,2,1,0:T(8,128)}, f32[4096,4,32,128]{3,2,1,0:T(8,128)}, /*index=35*/f32[4096,4,8,128]{3,2,1,0:T(8,128)}, f32[4096,128256]{1,0:T(8,128)}, f32[128256,4096]{1,0:T(8,128)}, s32[]{:T(128)}, s32[4,128]{1,0:T(4,128)}, /*index=40*/s32[4,128]{1,0:T(4,128)}, s32[4,128]{1,0:T(4,128)}, s32[4,128]{1,0:T(4,128)}, s32[4,128]{1,0:T(4,128)})->(s32[]{:T(128)}, f32[4096]{0:T(1024)}, f32[4096,4,14336]{2,1,0:T(4,128)}, f32[4096,4,14336]{2,1,0:T(4,128)}, f32[14336,4,4096]{2,1,0:T(4,128)}, /*index=5*/f32[4096,4]{0,1:T(4,128)}, f32[4096,4]{0,1:T(4,128)}, f32[4096,4,8,128]{3,2,1,0:T(8,128)}, f32[32,4,128,4096]{3,2,1,0:T(8,128)}, f32[4096,4,32,128]{3,2,1,0:T(8,128)}, /*index=10*/f32[4096,4,8,128]{3,2,1,0:T(8,128)}, f32[4096,128256]{1,0:T(8,128)}, f32[128256,4096]{1,0:T(8,128)}, s32[]{:T(128)}, f32[4096]{0:T(1024)}, /*index=15*/f32[4096,4,14336]{2,1,0:T(4,128)}, f32[4096,4,14336]{2,1,0:T(4,128)}, f32[14336,4,4096]{2,1,0:T(4,128)}, f32[4096,4]{0,1:T(4,128)}, f32[4096,4]{0,1:T(4,128)}, /*index=20*/f32[4096,4,8,128]{3,2,1,0:T(8,128)}, f32[32,4,128,4096]{3,2,1,0:T(8,128)}, f32[4096,4,32,128]{3,2,1,0:T(8,128)}, f32[4096,4,8,128]{3,2,1,0:T(8,128)}, f32[4096,128256]{1,0:T(8,128)}, /*index=25*/f32[128256,4096]{1,0:T(8,128)}, f32[4096]{0:T(1024)}, f32[4096,4,14336]{2,1,0:T(4,128)}, f32[4096,4,14336]{2,1,0:T(4,128)}, f32[14336,4,4096]{2,1,0:T(4,128)}, /*index=30*/f32[4096,4]{0,1:T(4,128)}, f32[4096,4]{0,1:T(4,128)}, f32[4096,4,8,128]{3,2,1,0:T(8,128)}, f32[32,4,128,4096]{3,2,1,0:T(8,128)}, f32[4096,4,32,128]{3,2,1,0:T(8,128)}, /*index=35*/f32[4096,4,8,128]{3,2,1,0:T(8,128)}, f32[4096,128256]{1,0:T(8,128)}, f32[128256,4096]{1,0:T(8,128)}, s32[]{:T(128)}, f32[]{:T(128)}, /*index=40*/f32[]{:T(128)}, f32[]{:T(128)}, f32[]{:T(128)}, f32[]{:T(128)}, f32[]{:T(128)}, /*index=45*/f32[]{:T(128)}, f32[]{:T(128)}, f32[]{:T(128)}, s32[]{:T(128)}, f32[]{:T(128)})}, allow_spmd_sharding_propagation_to_parameters={false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false}, allow_spmd_sharding_propagation_to_output={false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,true,true,true,true,true,true,true,true,true,true,true}, num_partitions=4

FileNames

FunctionNames

FileLocations

StackFrames


%fused_computation (param_0.2: bf16[128256,4096], param_1.7: s32[1024]) -> bf16[512,4096] {
  %param_0.2 = bf16[128256,4096]{1,0:T(8,128)(2,1)} parameter(0)
  %param_1.7 = s32[1024]{0:T(1024)S(1)} parameter(1)
  %custom-call.1 = s32[1024]{0:T(1024)} custom-call(%param_1.7), custom_call_target="AssumeGatherIndicesInBound", operand_layout_constraints={s32[1024]{0:T(1024)}}, metadata={op_name="jit(train_step)/jvp(TransformerLinenPure.apply)/TransformerLinenPure/decoder/decoder._apply_embedding/token_embedder/gather" stack_frame_id=0}
  %slice.6 = s32[512]{0:T(512)} slice(%custom-call.1), slice={[0:512]}, metadata={op_name="jit(train_step)/jvp(TransformerLinenPure.apply)/TransformerLinenPure/decoder/decoder._apply_embedding/token_embedder/gather" stack_frame_id=0}
  %reshape.380 = s32[4,128]{1,0:T(4,128)} reshape(%slice.6), metadata={op_name="jit(train_step)/jvp(TransformerLinenPure.apply)/TransformerLinenPure/decoder/decoder._apply_embedding/token_embedder/broadcast_in_dim" stack_frame_id=0}
  %transpose.241 = s32[4,128]{1,0:T(4,128)} transpose(%reshape.380), dimensions={0,1}, metadata={op_name="jit(train_step)/jvp(TransformerLinenPure.apply)/TransformerLinenPure/decoder/decoder._apply_embedding/token_embedder/broadcast_in_dim" stack_frame_id=0}
  %gather.4 = bf16[4,128,4096]{2,1,0:T(8,128)(2,1)} gather(%param_0.2, %transpose.241), offset_dims={2}, collapsed_slice_dims={0}, start_index_map={0}, index_vector_dim=2, slice_sizes={1,4096}, metadata={op_name="jit(train_step)/jvp(TransformerLinenPure.apply)/TransformerLinenPure/decoder/decoder._apply_embedding/token_embedder/gather" stack_frame_id=0}
  %transpose.240 = bf16[4,128,4096]{2,1,0:T(8,128)(2,1)} transpose(%gather.4), dimensions={0,1,2}, metadata={op_name="jit(train_step)/jvp(TransformerLinenPure.apply)/TransformerLinenPure/decoder/decoder._apply_embedding/token_embedder/gather" stack_frame_id=0}
  ROOT %reshape.379 = bf16[512,4096]{1,0:T(8,128)(2,1)} reshape(%transpose.240), metadata={op_name="jit(train_step)/jvp(TransformerLinenPure.apply)/TransformerLinenPure/decoder/decoder._apply_embedding/token_embedder/gather" stack_frame_id=0}
}

%region_33.38.clone (scatter-add.6: bf16[], scatter-add.7: bf16[]) -> bf16[] {
  %scatter-add.6 = bf16[]{:T(256)} parameter(0), metadata={op_name="jit(train_step)/transpose(jvp(TransformerLinenPure.apply))/TransformerLinenPure/decoder/decoder._apply_embedding/token_embedder/scatter-add"}
  %scatter-add.7 = bf16[]{:T(256)} parameter(1), metadata={op_name="jit(train_step)/transpose(jvp(TransformerLinenPure.apply))/TransformerLinenPure/decoder/decoder._apply_embedding/token_embedder/scatter-add"}
  ROOT %add.462 = bf16[]{:T(256)} add(%scatter-add.6, %scatter-add.7), metadata={op_name="jit(train_step)/transpose(jvp(TransformerLinenPure.apply))/TransformerLinenPure/decoder/decoder._apply_embedding/token_embedder/add" stack_frame_id=0}, backend_config={"flag_configs":[],"scoped_memory_configs":[],"used_scoped_memory_configs":[],"aliasing_operands":{"lists":[]}}
}

%fused_computation.1 (param_0.3: bf16[128256,4096], param_1.5: s32[512], param_2.4: bf16[512,4096]) -> bf16[128256,4096] {
  %param_0.3 = bf16[128256,4096]{1,0:T(8,128)(2,1)} parameter(0)
  %param_1.5 = s32[512]{0:T(512)S(1)} parameter(1)
  %reshape.387 = s32[4,128]{1,0:T(4,128)} reshape(%param_1.5), metadata={op_name="jit(train_step)/jvp(TransformerLinenPure.apply)/TransformerLinenPure/decoder/decoder._apply_embedding/token_embedder/broadcast_in_dim" stack_frame_id=0}
  %transpose.246 = s32[4,128]{1,0:T(4,128)} transpose(%reshape.387), dimensions={0,1}, metadata={op_name="jit(train_step)/jvp(TransformerLinenPure.apply)/TransformerLinenPure/decoder/decoder._apply_embedding/token_embedder/broadcast_in_dim" stack_frame_id=0}
  %param_2.4 = bf16[512,4096]{1,0:T(8,128)(2,1)S(1)} parameter(2)
  %reshape.388 = bf16[4,128,4096]{2,1,0:T(8,128)(2,1)} reshape(%param_2.4), metadata={op_name="jit(train_step)/transpose(jvp(TransformerLinenPure.apply))/TransformerLinenPure/decoder/while" stack_frame_id=0}
  %transpose.247 = bf16[4,128,4096]{2,1,0:T(8,128)(2,1)} transpose(%reshape.388), dimensions={0,1,2}, metadata={op_name="jit(train_step)/transpose(jvp(TransformerLinenPure.apply))/TransformerLinenPure/decoder/while" stack_frame_id=0}
  ROOT %scatter.2 = bf16[128256,4096]{1,0:T(8,128)(2,1)} scatter(%param_0.3, %transpose.246, %transpose.247), update_window_dims={2}, inserted_window_dims={0}, scatter_dims_to_operand_dims={0}, index_vector_dim=2, to_apply=%region_33.38.clone, metadata={op_name="jit(train_step)/transpose(jvp(TransformerLinenPure.apply))/TransformerLinenPure/decoder/decoder._apply_embedding/token_embedder/scatter-add" stack_frame_id=0}
}

%region_32.37 (reduce_sum.244: f32[], reduce_sum.245: f32[]) -> f32[] {
  %reduce_sum.244 = f32[]{:T(128)} parameter(0), metadata={op_name="jit(train_step)/reduce_sum"}
  %reduce_sum.245 = f32[]{:T(128)} parameter(1), metadata={op_name="jit(train_step)/reduce_sum"}
  ROOT %reduce_sum.249 = f32[]{:T(128)} add(%reduce_sum.244, %reduce_sum.245), metadata={op_name="jit(train_step)/reduce_sum" stack_frame_id=0}, backend_config={"flag_configs":[],"scoped_memory_configs":[],"used_scoped_memory_configs":[],"aliasing_operands":{"lists":[]}}
}

%fused_computation.280.clone.clone.clone (param_0.1106: bf16[4,128,128256], param_1.1269: s32[4,128], param_2.1080: f32[4,128], param_3.773: f32[4,128], param_4.481: bf16[4,128], param_5.412: f32[4,128]) -> bf16[4,128,128256] {
  %param_5.412 = f32[4,128]{1,0:T(4,128)S(1)} parameter(5)
  %mul.1937 = f32[4,128,128256]{2,1,0:T(8,128)} broadcast(%param_5.412), dimensions={0,1}, metadata={op_name="jit(train_step)/transpose(jvp())/mul" stack_frame_id=0}
  %param_3.773 = f32[4,128]{1,0:T(4,128)S(1)} parameter(3)
  %mul.1936 = f32[4,128,128256]{2,1,0:T(8,128)} broadcast(%param_3.773), dimensions={0,1}, metadata={op_name="jit(train_step)/transpose(jvp())/mul" stack_frame_id=0}
  %param_0.1106 = bf16[4,128,128256]{2,1,0:T(8,128)(2,1)} parameter(0)
  %convert_element_type.1060 = f32[4,128,128256]{2,1,0:T(8,128)} convert(%param_0.1106), metadata={op_name="jit(train_step)/jvp(TransformerLinenPure.apply)/TransformerLinenPure/decoder/decoder.apply_output_head/convert_element_type" stack_frame_id=0}
  %param_4.481 = bf16[4,128]{1,0:T(4,128)(2,1)S(1)} parameter(4)
  %sub.94 = f32[4,128,128256]{2,1,0:T(8,128)} broadcast(%param_4.481), dimensions={0,1}, metadata={op_name="jit(train_step)/jvp()/sub" stack_frame_id=0}
  %sub.93 = f32[4,128,128256]{2,1,0:T(8,128)} subtract(%convert_element_type.1060, %sub.94), metadata={op_name="jit(train_step)/jvp()/sub" stack_frame_id=0}
  %exp.62 = f32[4,128,128256]{2,1,0:T(8,128)} exponential(%sub.93), metadata={op_name="jit(train_step)/jvp()/exp" stack_frame_id=0}
  %mul.1935 = f32[4,128,128256]{2,1,0:T(8,128)} multiply(%mul.1936, %exp.62), metadata={op_name="jit(train_step)/transpose(jvp())/mul" stack_frame_id=0}
  %param_2.1080 = f32[4,128]{1,0:T(4,128)S(1)} parameter(2)
  %div.823 = f32[4,128,128256]{2,1,0:T(8,128)} broadcast(%param_2.1080), dimensions={0,1}, metadata={op_name="jit(train_step)/transpose(jvp())/div" stack_frame_id=0}
  %div.822 = f32[4,128,128256]{2,1,0:T(8,128)} divide(%mul.1935, %div.823), metadata={op_name="jit(train_step)/transpose(jvp())/div" stack_frame_id=0}
  %param_1.1269 = s32[4,128]{1,0:T(4,128)S(1)} parameter(1)
  %eq.49 = s32[4,128,128256]{2,1,0:T(8,128)} broadcast(%param_1.1269), dimensions={0,1}, metadata={op_name="jit(train_step)/jvp(jit(_one_hot))/eq" stack_frame_id=0}
  %eq.48 = s32[4,128,128256]{2,1,0:T(8,128)} iota(), iota_dimension=2, metadata={op_name="jit(train_step)/jvp(jit(_one_hot))/eq" stack_frame_id=0}
  %eq.47 = pred[4,128,128256]{2,1,0:T(8,128)(4,1)} compare(%eq.49, %eq.48), direction=EQ, metadata={op_name="jit(train_step)/jvp(jit(_one_hot))/eq" stack_frame_id=0}
  %convert_element_type.1059 = f32[4,128,128256]{2,1,0:T(8,128)} convert(%eq.47), metadata={op_name="jit(train_step)/jvp(jit(_one_hot))/convert_element_type" stack_frame_id=0}
  %sub.92 = f32[4,128,128256]{2,1,0:T(8,128)} subtract(%div.822, %convert_element_type.1059), metadata={op_name="jit(train_step)/transpose(jvp())/sub" stack_frame_id=0}
  %mul.1934 = f32[4,128,128256]{2,1,0:T(8,128)} multiply(%mul.1937, %sub.92), metadata={op_name="jit(train_step)/transpose(jvp())/mul" stack_frame_id=0}
  ROOT %convert_element_type.1058 = bf16[4,128,128256]{2,1,0:T(8,128)(2,1)} convert(%mul.1934), metadata={op_name="jit(train_step)/transpose(jvp(TransformerLinenPure.apply))/TransformerLinenPure/decoder/decoder.apply_output_head/convert_element_type" stack_frame_id=0}
}

%fused_computation.316.clone.clone (param_0.1107: f32[4,128], param_1.1270: bf16[4,128,4096], param_2.1082: bf16[4096]) -> bf16[4,128,4096] {
  %param_1.1270 = bf16[4,128,4096]{2,1,0:T(8,128)(2,1)S(1)} parameter(1)
  %convert_element_type.1062 = f32[4,128,4096]{2,1,0:T(8,128)} convert(%param_1.1270), metadata={op_name="jit(train_step)/jvp(TransformerLinenPure.apply)/TransformerLinenPure/decoder/decoder.apply_output_head/decoder_norm/convert_element_type" stack_frame_id=0}
  %param_0.1107 = f32[4,128]{1,0:T(4,128)S(1)} parameter(0)
  %mul.1940 = f32[4,128,4096]{2,1,0:T(8,128)} broadcast(%param_0.1107), dimensions={0,1}, metadata={op_name="jit(train_step)/jvp(TransformerLinenPure.apply)/TransformerLinenPure/decoder/decoder.apply_output_head/decoder_norm/mul" stack_frame_id=0}
  %mul.1939 = f32[4,128,4096]{2,1,0:T(8,128)} multiply(%convert_element_type.1062, %mul.1940), metadata={op_name="jit(train_step)/jvp(TransformerLinenPure.apply)/TransformerLinenPure/decoder/decoder.apply_output_head/decoder_norm/mul" stack_frame_id=0}
  %convert_element_type.1061 = bf16[4,128,4096]{2,1,0:T(8,128)(2,1)} convert(%mul.1939), metadata={op_name="jit(train_step)/jvp(TransformerLinenPure.apply)/TransformerLinenPure/decoder/decoder.apply_output_head/decoder_norm/convert_element_type" stack_frame_id=0}
  %param_2.1082 = bf16[4096]{0:T(1024)(128)(2,1)S(1)} parameter(2)
  %mul.1941 = bf16[4,128,4096]{2,1,0:T(8,128)(2,1)} broadcast(%param_2.1082), dimensions={2}, metadata={op_name="jit(train_step)/jvp(TransformerLinenPure.apply)/TransformerLinenPure/decoder/decoder.apply_output_head/decoder_norm/mul" stack_frame_id=0}
  ROOT %mul.1938 = bf16[4,128,4096]{2,1,0:T(8,128)(2,1)} multiply(%convert_element_type.1061, %mul.1941), metadata={op_name="jit(train_step)/jvp(TransformerLinenPure.apply)/TransformerLinenPure/decoder/decoder.apply_output_head/decoder_norm/mul" stack_frame_id=0}
}

%fused_computation.219 (param_0.1126: bf16[4,128,128256], param_1.1285: s32[4,128], param_2.1106: f32[4,128], param_3.789: f32[4,128], param_4.496: bf16[4,128], param_5.427: f32[4,128], param_6.300: f32[4,128], param_7.198: bf16[4,128,4096], param_8.116: bf16[4096]) -> (f32[], bf16[4096,128256,1]) {
  %param_6.300 = f32[4,128]{1,0:T(4,128)S(1)} parameter(6)
  %param_7.198 = bf16[4,128,4096]{2,1,0:T(8,128)(2,1)S(1)} parameter(7)
  %param_8.116 = bf16[4096]{0:T(1024)(128)(2,1)S(1)} parameter(8)
  %fusion.239.clone.1 = bf16[4,128,4096]{2,1,0:T(8,128)(2,1)} fusion(%param_6.300, %param_7.198, %param_8.116), kind=kLoop, calls=%fused_computation.316.clone.clone, metadata={op_name="jit(train_step)/jvp(TransformerLinenPure.apply)/TransformerLinenPure/decoder/decoder.apply_output_head/decoder_norm/mul" stack_frame_id=0}
  %param_0.1126 = bf16[4,128,128256]{2,1,0:T(8,128)(2,1)} parameter(0)
  %param_1.1285 = s32[4,128]{1,0:T(4,128)S(1)} parameter(1)
  %param_2.1106 = f32[4,128]{1,0:T(4,128)S(1)} parameter(2)
  %param_3.789 = f32[4,128]{1,0:T(4,128)S(1)} parameter(3)
  %param_4.496 = bf16[4,128]{1,0:T(4,128)(2,1)S(1)} parameter(4)
  %param_5.427 = f32[4,128]{1,0:T(4,128)S(1)} parameter(5)
  %multiply_convert_fusion.1.clone.1 = bf16[4,128,128256]{2,1,0:T(8,128)(2,1)} fusion(%param_0.1126, %param_1.1285, %param_2.1106, %param_3.789, %param_4.496, /*index=5*/%param_5.427), kind=kLoop, calls=%fused_computation.280.clone.clone.clone, metadata={op_name="jit(train_step)/transpose(jvp(TransformerLinenPure.apply))/TransformerLinenPure/decoder/decoder.apply_output_head/convert_element_type" stack_frame_id=0}
  %convolution.88.clone.1 = bf16[4096,128256,1]{1,0,2:T(8,128)(2,1)} convolution(%fusion.239.clone.1, %multiply_convert_fusion.1.clone.1), window={size=4}, dim_labels=0fb_0io->bf0, metadata={op_name="jit(train_step)/transpose(jvp(TransformerLinenPure.apply))/TransformerLinenPure/decoder/decoder.apply_output_head/logits_dense/dot_general" stack_frame_id=0}
  %bitcast.306 = bf16[4096,128256]{1,0:T(8,128)(2,1)} bitcast(%convolution.88.clone.1), metadata={op_name="jit(train_step)/transpose(jvp(TransformerLinenPure.apply))/TransformerLinenPure/decoder/decoder.apply_output_head/logits_dense/dot_general" stack_frame_id=0}
  %convert_element_type.939 = f32[4096,128256]{1,0:T(8,128)} convert(%bitcast.306), metadata={op_name="jit(train_step)/transpose(jvp(TransformerLinenPure.apply))/TransformerLinenPure/decoder/decoder.apply_output_head/logits_dense/convert_element_type" stack_frame_id=0}
  %square.157 = f32[4096,128256]{1,0:T(8,128)} multiply(%convert_element_type.939, %convert_element_type.939), metadata={op_name="jit(train_step)/square" stack_frame_id=0}
  %constant.998 = f32[]{:T(128)} constant(0)
  %reduce.79 = f32[]{:T(128)} reduce(%square.157, %constant.998), dimensions={0,1}, to_apply=%region_32.37, metadata={op_name="jit(train_step)/reduce_sum" stack_frame_id=0}
  ROOT %tuple.154 = (f32[]{:T(128)}, bf16[4096,128256,1]{1,0,2:T(8,128)(2,1)}) tuple(%reduce.79, %convolution.88.clone.1)
}

%region_34.39 (reduce_sum.250: f32[], reduce_sum.251: f32[]) -> f32[] {
  %reduce_sum.250 = f32[]{:T(128)} parameter(0), metadata={op_name="jit(train_step)/reduce_sum"}
  %reduce_sum.251 = f32[]{:T(128)} parameter(1), metadata={op_name="jit(train_step)/reduce_sum"}
  ROOT %reduce_sum.252 = f32[]{:T(128)} add(%reduce_sum.250, %reduce_sum.251), metadata={op_name="jit(train_step)/reduce_sum" stack_frame_id=0}, backend_config={"flag_configs":[],"scoped_memory_configs":[],"used_scoped_memory_configs":[],"aliasing_operands":{"lists":[]}}
}

%fused_computation.220 (param_0.1125: bf16[128256,4096]) -> f32[] {
  %param_0.1125 = bf16[128256,4096]{1,0:T(8,128)(2,1)} parameter(0)
  %convert_element_type.941 = f32[128256,4096]{1,0:T(8,128)} convert(%param_0.1125), metadata={op_name="jit(train_step)/transpose(jvp(TransformerLinenPure.apply))/TransformerLinenPure/decoder/decoder._apply_embedding/token_embedder/convert_element_type" stack_frame_id=0}
  %square.159 = f32[128256,4096]{1,0:T(8,128)} multiply(%convert_element_type.941, %convert_element_type.941), metadata={op_name="jit(train_step)/square" stack_frame_id=0}
  %constant.997 = f32[]{:T(128)} constant(0)
  ROOT %reduce.80 = f32[]{:T(128)} reduce(%square.159, %constant.997), dimensions={0,1}, to_apply=%region_34.39, metadata={op_name="jit(train_step)/reduce_sum" stack_frame_id=0}
}

%region_60.65 (reduce_sum.385: f32[], reduce_sum.389: f32[]) -> f32[] {
  %reduce_sum.385 = f32[]{:T(128)} parameter(0), metadata={op_name="jit(train_step)/reduce_sum"}
  %reduce_sum.389 = f32[]{:T(128)} parameter(1), metadata={op_name="jit(train_step)/reduce_sum"}
  ROOT %reduce_sum.390 = f32[]{:T(128)} add(%reduce_sum.385, %reduce_sum.389), metadata={op_name="jit(train_step)/reduce_sum" stack_frame_id=0}, backend_config={"flag_configs":[],"scoped_memory_configs":[],"used_scoped_memory_configs":[],"aliasing_operands":{"lists":[]}}
}

%region_46.51 (reduce_sum.313: f32[], reduce_sum.314: f32[]) -> f32[] {
  %reduce_sum.313 = f32[]{:T(128)} parameter(0), metadata={op_name="jit(train_step)/reduce_sum"}
  %reduce_sum.314 = f32[]{:T(128)} parameter(1), metadata={op_name="jit(train_step)/reduce_sum"}
  ROOT %reduce_sum.315 = f32[]{:T(128)} add(%reduce_sum.313, %reduce_sum.314), metadata={op_name="jit(train_step)/reduce_sum" stack_frame_id=0}, backend_config={"flag_configs":[],"scoped_memory_configs":[],"used_scoped_memory_configs":[],"aliasing_operands":{"lists":[]}}
}

%fused_computation.221 (param_0.1113: f32[128256,4096], param_1.1273: f32[], param_2.1094: f32[], param_3.777: f32[], param_4.484: f32[128256,4096], param_5.415: f32[], param_6.288: bf16[128256,4096], param_7.186: pred[], param_8.104: f32[128256,4096]) -> (f32[], f32[128256,4096], f32[128256,4096], f32[128256,4096], f32[]) {
  %param_0.1113 = f32[128256,4096]{1,0:T(8,128)} parameter(0)
  %param_3.777 = f32[]{:T(128)S(6)} parameter(3)
  %mul.1800.clone.1 = f32[128256,4096]{1,0:T(8,128)} broadcast(%param_3.777), dimensions={}, metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %param_7.186 = pred[]{:T(512)S(6)} parameter(7)
  %select_n.242.clone.1 = pred[128256,4096]{1,0:T(8,128)(4,1)} broadcast(%param_7.186), dimensions={}, metadata={op_name="jit(train_step)/select_n" stack_frame_id=0}
  %param_6.288 = bf16[128256,4096]{1,0:T(8,128)(2,1)} parameter(6)
  %convert_element_type.1033.clone.1 = f32[128256,4096]{1,0:T(8,128)} convert(%param_6.288), metadata={op_name="jit(train_step)/transpose(jvp(TransformerLinenPure.apply))/TransformerLinenPure/decoder/decoder._apply_embedding/token_embedder/convert_element_type" stack_frame_id=0}
  %param_5.415 = f32[]{:T(128)} parameter(5)
  %div.725.clone.1 = f32[128256,4096]{1,0:T(8,128)} broadcast(%param_5.415), dimensions={}, metadata={op_name="jit(train_step)/div" stack_frame_id=0}
  %div.724.clone.1 = f32[128256,4096]{1,0:T(8,128)} divide(%convert_element_type.1033.clone.1, %div.725.clone.1), metadata={op_name="jit(train_step)/div" stack_frame_id=0}
  %select_n.241.clone.1 = f32[128256,4096]{1,0:T(8,128)} select(%select_n.242.clone.1, %convert_element_type.1033.clone.1, %div.724.clone.1), metadata={op_name="jit(train_step)/select_n" stack_frame_id=0}
  %constant.899.clone.1 = f32[]{:T(128)} constant(0.1)
  %broadcast.515.clone.1 = f32[128256,4096]{1,0:T(8,128)} broadcast(%constant.899.clone.1), dimensions={}, metadata={op_name="broadcast.61"}
  %mul.1806.clone.1 = f32[128256,4096]{1,0:T(8,128)} multiply(%select_n.241.clone.1, %broadcast.515.clone.1), metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %param_8.104 = f32[128256,4096]{1,0:T(8,128)} parameter(8)
  %constant.903.clone.1 = f32[]{:T(128)} constant(0.9)
  %mul.1807.clone.1 = f32[128256,4096]{1,0:T(8,128)} broadcast(%constant.903.clone.1), dimensions={}, metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %mul.1805.clone.1 = f32[128256,4096]{1,0:T(8,128)} multiply(%param_8.104, %mul.1807.clone.1), metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %add.762.clone.1 = f32[128256,4096]{1,0:T(8,128)} add(%mul.1806.clone.1, %mul.1805.clone.1), metadata={op_name="jit(train_step)/add" stack_frame_id=0}
  %param_2.1094 = f32[]{:T(128)S(6)} parameter(2)
  %div.721.clone.1 = f32[128256,4096]{1,0:T(8,128)} broadcast(%param_2.1094), dimensions={}, metadata={op_name="jit(train_step)/div" stack_frame_id=0}
  %integer_pow.60.clone.1 = f32[128256,4096]{1,0:T(8,128)} multiply(%select_n.241.clone.1, %select_n.241.clone.1), metadata={op_name="jit(train_step)/integer_pow" stack_frame_id=0}
  %constant.902.clone.1 = f32[]{:T(128)} constant(0.05)
  %mul.1804.clone.1 = f32[128256,4096]{1,0:T(8,128)} broadcast(%constant.902.clone.1), dimensions={}, metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %mul.1802.clone.1 = f32[128256,4096]{1,0:T(8,128)} multiply(%integer_pow.60.clone.1, %mul.1804.clone.1), metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %param_4.484 = f32[128256,4096]{1,0:T(8,128)} parameter(4)
  %constant.901.clone.1 = f32[]{:T(128)} constant(0.95)
  %mul.1803.clone.1 = f32[128256,4096]{1,0:T(8,128)} broadcast(%constant.901.clone.1), dimensions={}, metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %mul.1801.clone.1 = f32[128256,4096]{1,0:T(8,128)} multiply(%param_4.484, %mul.1803.clone.1), metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %add.761.clone.1 = f32[128256,4096]{1,0:T(8,128)} add(%mul.1802.clone.1, %mul.1801.clone.1), metadata={op_name="jit(train_step)/add" stack_frame_id=0}
  %param_1.1273 = f32[]{:T(128)S(6)} parameter(1)
  %div.720.clone.1 = f32[128256,4096]{1,0:T(8,128)} broadcast(%param_1.1273), dimensions={}, metadata={op_name="jit(train_step)/div" stack_frame_id=0}
  %div.719.clone.1 = f32[128256,4096]{1,0:T(8,128)} divide(%add.761.clone.1, %div.720.clone.1), metadata={op_name="jit(train_step)/div" stack_frame_id=0}
  %sqrt.58.clone.1 = f32[128256,4096]{1,0:T(8,128)} sqrt(%div.719.clone.1), metadata={op_name="jit(train_step)/sqrt" stack_frame_id=0}
  %constant.900.clone.1 = f32[]{:T(128)} constant(1e-08)
  %add.760.clone.1 = f32[128256,4096]{1,0:T(8,128)} broadcast(%constant.900.clone.1), dimensions={}, metadata={op_name="jit(train_step)/add" stack_frame_id=0}
  %add.759.clone.1 = f32[128256,4096]{1,0:T(8,128)} add(%sqrt.58.clone.1, %add.760.clone.1), metadata={op_name="jit(train_step)/add" stack_frame_id=0}
  %multiply.183.clone.1 = f32[128256,4096]{1,0:T(8,128)} multiply(%div.721.clone.1, %add.759.clone.1), metadata={op_name="multiply.33"}
  %div.718.clone.1 = f32[128256,4096]{1,0:T(8,128)} divide(%add.762.clone.1, %multiply.183.clone.1), metadata={op_name="jit(train_step)/div" stack_frame_id=0}
  %mul.1799.clone.1 = f32[128256,4096]{1,0:T(8,128)} multiply(%param_0.1113, %broadcast.515.clone.1), metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %add.758.clone.1 = f32[128256,4096]{1,0:T(8,128)} add(%div.718.clone.1, %mul.1799.clone.1), metadata={op_name="jit(train_step)/add" stack_frame_id=0}
  %mul.1798.clone.1 = f32[128256,4096]{1,0:T(8,128)} multiply(%mul.1800.clone.1, %add.758.clone.1), metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %add.757.clone.1 = f32[128256,4096]{1,0:T(8,128)} add(%param_0.1113, %mul.1798.clone.1), metadata={op_name="jit(train_step)/add" stack_frame_id=0}
  %square.160 = f32[128256,4096]{1,0:T(8,128)} multiply(%add.757.clone.1, %add.757.clone.1), metadata={op_name="jit(train_step)/square" stack_frame_id=0}
  %constant.985 = f32[]{:T(128)} constant(0)
  %reduce.81 = f32[]{:T(128)} reduce(%square.160, %constant.985), dimensions={0,1}, to_apply=%region_60.65, metadata={op_name="jit(train_step)/reduce_sum" stack_frame_id=0}
  %reduce.83.clone.1 = f32[]{:T(128)} reduce(%integer_pow.60.clone.1, %constant.985), dimensions={0,1}, to_apply=%region_46.51, metadata={op_name="jit(train_step)/reduce_sum" stack_frame_id=0}
  ROOT %tuple.135 = (f32[]{:T(128)}, f32[128256,4096]{1,0:T(8,128)}, f32[128256,4096]{1,0:T(8,128)}, f32[128256,4096]{1,0:T(8,128)}, f32[]{:T(128)}) tuple(%reduce.81, %add.757.clone.1, %add.761.clone.1, %add.762.clone.1, %reduce.83.clone.1)
}

%region_59.64 (reduce_sum.382: f32[], reduce_sum.383: f32[]) -> f32[] {
  %reduce_sum.382 = f32[]{:T(128)} parameter(0), metadata={op_name="jit(train_step)/reduce_sum"}
  %reduce_sum.383 = f32[]{:T(128)} parameter(1), metadata={op_name="jit(train_step)/reduce_sum"}
  ROOT %reduce_sum.384 = f32[]{:T(128)} add(%reduce_sum.382, %reduce_sum.383), metadata={op_name="jit(train_step)/reduce_sum" stack_frame_id=0}, backend_config={"flag_configs":[],"scoped_memory_configs":[],"used_scoped_memory_configs":[],"aliasing_operands":{"lists":[]}}
}

%region_45.50 (reduce_sum.307: f32[], reduce_sum.308: f32[]) -> f32[] {
  %reduce_sum.307 = f32[]{:T(128)} parameter(0), metadata={op_name="jit(train_step)/reduce_sum"}
  %reduce_sum.308 = f32[]{:T(128)} parameter(1), metadata={op_name="jit(train_step)/reduce_sum"}
  ROOT %reduce_sum.312 = f32[]{:T(128)} add(%reduce_sum.307, %reduce_sum.308), metadata={op_name="jit(train_step)/reduce_sum" stack_frame_id=0}, backend_config={"flag_configs":[],"scoped_memory_configs":[],"used_scoped_memory_configs":[],"aliasing_operands":{"lists":[]}}
}

%fused_computation.222 (param_0.1114: f32[4096,128256], param_1.1274: f32[], param_2.1095: f32[], param_3.778: f32[], param_4.485: f32[4096,128256], param_5.416: f32[], param_6.289: bf16[4096,128256,1], param_7.187: pred[], param_8.105: f32[4096,128256]) -> (f32[], f32[4096,128256], f32[4096,128256], f32[4096,128256], f32[]) {
  %param_0.1114 = f32[4096,128256]{1,0:T(8,128)} parameter(0)
  %param_3.778 = f32[]{:T(128)S(6)} parameter(3)
  %mul.1810.clone.1 = f32[4096,128256]{1,0:T(8,128)} broadcast(%param_3.778), dimensions={}, metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %param_7.187 = pred[]{:T(512)S(6)} parameter(7)
  %select_n.246.clone.1 = pred[4096,128256]{1,0:T(8,128)(4,1)} broadcast(%param_7.187), dimensions={}, metadata={op_name="jit(train_step)/select_n" stack_frame_id=0}
  %param_6.289 = bf16[4096,128256,1]{1,0,2:T(8,128)(2,1)} parameter(6)
  %bitcast.409.clone.1 = bf16[4096,128256]{1,0:T(8,128)(2,1)} bitcast(%param_6.289), metadata={op_name="jit(train_step)/transpose(jvp(TransformerLinenPure.apply))/TransformerLinenPure/decoder/decoder.apply_output_head/logits_dense/dot_general" stack_frame_id=0}
  %convert_element_type.1035.clone.1 = f32[4096,128256]{1,0:T(8,128)} convert(%bitcast.409.clone.1), metadata={op_name="jit(train_step)/transpose(jvp(TransformerLinenPure.apply))/TransformerLinenPure/decoder/decoder.apply_output_head/logits_dense/convert_element_type" stack_frame_id=0}
  %param_5.416 = f32[]{:T(128)} parameter(5)
  %div.733.clone.1 = f32[4096,128256]{1,0:T(8,128)} broadcast(%param_5.416), dimensions={}, metadata={op_name="jit(train_step)/div" stack_frame_id=0}
  %div.732.clone.1 = f32[4096,128256]{1,0:T(8,128)} divide(%convert_element_type.1035.clone.1, %div.733.clone.1), metadata={op_name="jit(train_step)/div" stack_frame_id=0}
  %select_n.245.clone.1 = f32[4096,128256]{1,0:T(8,128)} select(%select_n.246.clone.1, %convert_element_type.1035.clone.1, %div.732.clone.1), metadata={op_name="jit(train_step)/select_n" stack_frame_id=0}
  %constant.905.clone.1 = f32[]{:T(128)} constant(0.1)
  %broadcast.517.clone.1 = f32[4096,128256]{1,0:T(8,128)} broadcast(%constant.905.clone.1), dimensions={}, metadata={op_name="broadcast.62"}
  %mul.1816.clone.1 = f32[4096,128256]{1,0:T(8,128)} multiply(%select_n.245.clone.1, %broadcast.517.clone.1), metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %param_8.105 = f32[4096,128256]{1,0:T(8,128)} parameter(8)
  %constant.909.clone.1 = f32[]{:T(128)} constant(0.9)
  %mul.1817.clone.1 = f32[4096,128256]{1,0:T(8,128)} broadcast(%constant.909.clone.1), dimensions={}, metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %mul.1815.clone.1 = f32[4096,128256]{1,0:T(8,128)} multiply(%param_8.105, %mul.1817.clone.1), metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %add.768.clone.1 = f32[4096,128256]{1,0:T(8,128)} add(%mul.1816.clone.1, %mul.1815.clone.1), metadata={op_name="jit(train_step)/add" stack_frame_id=0}
  %param_2.1095 = f32[]{:T(128)S(6)} parameter(2)
  %div.729.clone.1 = f32[4096,128256]{1,0:T(8,128)} broadcast(%param_2.1095), dimensions={}, metadata={op_name="jit(train_step)/div" stack_frame_id=0}
  %integer_pow.61.clone.1 = f32[4096,128256]{1,0:T(8,128)} multiply(%select_n.245.clone.1, %select_n.245.clone.1), metadata={op_name="jit(train_step)/integer_pow" stack_frame_id=0}
  %constant.908.clone.1 = f32[]{:T(128)} constant(0.05)
  %mul.1814.clone.1 = f32[4096,128256]{1,0:T(8,128)} broadcast(%constant.908.clone.1), dimensions={}, metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %mul.1812.clone.1 = f32[4096,128256]{1,0:T(8,128)} multiply(%integer_pow.61.clone.1, %mul.1814.clone.1), metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %param_4.485 = f32[4096,128256]{1,0:T(8,128)} parameter(4)
  %constant.907.clone.1 = f32[]{:T(128)} constant(0.95)
  %mul.1813.clone.1 = f32[4096,128256]{1,0:T(8,128)} broadcast(%constant.907.clone.1), dimensions={}, metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %mul.1811.clone.1 = f32[4096,128256]{1,0:T(8,128)} multiply(%param_4.485, %mul.1813.clone.1), metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %add.767.clone.1 = f32[4096,128256]{1,0:T(8,128)} add(%mul.1812.clone.1, %mul.1811.clone.1), metadata={op_name="jit(train_step)/add" stack_frame_id=0}
  %param_1.1274 = f32[]{:T(128)S(6)} parameter(1)
  %div.728.clone.1 = f32[4096,128256]{1,0:T(8,128)} broadcast(%param_1.1274), dimensions={}, metadata={op_name="jit(train_step)/div" stack_frame_id=0}
  %div.727.clone.1 = f32[4096,128256]{1,0:T(8,128)} divide(%add.767.clone.1, %div.728.clone.1), metadata={op_name="jit(train_step)/div" stack_frame_id=0}
  %sqrt.59.clone.1 = f32[4096,128256]{1,0:T(8,128)} sqrt(%div.727.clone.1), metadata={op_name="jit(train_step)/sqrt" stack_frame_id=0}
  %constant.906.clone.1 = f32[]{:T(128)} constant(1e-08)
  %add.766.clone.1 = f32[4096,128256]{1,0:T(8,128)} broadcast(%constant.906.clone.1), dimensions={}, metadata={op_name="jit(train_step)/add" stack_frame_id=0}
  %add.765.clone.1 = f32[4096,128256]{1,0:T(8,128)} add(%sqrt.59.clone.1, %add.766.clone.1), metadata={op_name="jit(train_step)/add" stack_frame_id=0}
  %multiply.184.clone.1 = f32[4096,128256]{1,0:T(8,128)} multiply(%div.729.clone.1, %add.765.clone.1), metadata={op_name="multiply.32"}
  %div.726.clone.1 = f32[4096,128256]{1,0:T(8,128)} divide(%add.768.clone.1, %multiply.184.clone.1), metadata={op_name="jit(train_step)/div" stack_frame_id=0}
  %mul.1809.clone.1 = f32[4096,128256]{1,0:T(8,128)} multiply(%param_0.1114, %broadcast.517.clone.1), metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %add.764.clone.1 = f32[4096,128256]{1,0:T(8,128)} add(%div.726.clone.1, %mul.1809.clone.1), metadata={op_name="jit(train_step)/add" stack_frame_id=0}
  %mul.1808.clone.1 = f32[4096,128256]{1,0:T(8,128)} multiply(%mul.1810.clone.1, %add.764.clone.1), metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %add.763.clone.1 = f32[4096,128256]{1,0:T(8,128)} add(%param_0.1114, %mul.1808.clone.1), metadata={op_name="jit(train_step)/add" stack_frame_id=0}
  %square.161 = f32[4096,128256]{1,0:T(8,128)} multiply(%add.763.clone.1, %add.763.clone.1), metadata={op_name="jit(train_step)/square" stack_frame_id=0}
  %constant.986 = f32[]{:T(128)} constant(0)
  %reduce.82 = f32[]{:T(128)} reduce(%square.161, %constant.986), dimensions={0,1}, to_apply=%region_59.64, metadata={op_name="jit(train_step)/reduce_sum" stack_frame_id=0}
  %reduce.84.clone.1 = f32[]{:T(128)} reduce(%integer_pow.61.clone.1, %constant.986), dimensions={0,1}, to_apply=%region_45.50, metadata={op_name="jit(train_step)/reduce_sum" stack_frame_id=0}
  ROOT %tuple.136 = (f32[]{:T(128)}, f32[4096,128256]{1,0:T(8,128)}, f32[4096,128256]{1,0:T(8,128)}, f32[4096,128256]{1,0:T(8,128)}, f32[]{:T(128)}) tuple(%reduce.82, %add.763.clone.1, %add.767.clone.1, %add.768.clone.1, %reduce.84.clone.1)
}

%region_25.30 (reduce_sum.208: f32[], reduce_sum.209: f32[]) -> f32[] {
  %reduce_sum.208 = f32[]{:T(128)} parameter(0), metadata={op_name="jit(train_step)/reduce_sum"}
  %reduce_sum.209 = f32[]{:T(128)} parameter(1), metadata={op_name="jit(train_step)/reduce_sum"}
  ROOT %reduce_sum.210 = f32[]{:T(128)} add(%reduce_sum.208, %reduce_sum.209), metadata={op_name="jit(train_step)/reduce_sum" stack_frame_id=0}, backend_config={"flag_configs":[],"scoped_memory_configs":[],"used_scoped_memory_configs":[],"aliasing_operands":{"lists":[]}}
}

%fused_computation.239 (param_0.1131: f32[4,14336,4096]) -> f32[] {
  %param_0.1131 = f32[4,14336,4096]{2,0,1:T(4,128)} parameter(0)
  %bitcast.314 = f32[14336,4,4096]{2,1,0:T(4,128)} bitcast(%param_0.1131), metadata={op_name="jit(train_step)/transpose(jvp(TransformerLinenPure.apply))/TransformerLinenPure/decoder/transpose" stack_frame_id=0}
  %square.164 = f32[14336,4,4096]{2,1,0:T(4,128)} multiply(%bitcast.314, %bitcast.314), metadata={op_name="jit(train_step)/square" stack_frame_id=0}
  %constant.1003 = f32[]{:T(128)} constant(0)
  ROOT %reduce.85 = f32[]{:T(128)} reduce(%square.164, %constant.1003), dimensions={0,1,2}, to_apply=%region_25.30, metadata={op_name="jit(train_step)/reduce_sum" stack_frame_id=0}
}

%region_24.29 (reduce_sum.202: f32[], reduce_sum.203: f32[]) -> f32[] {
  %reduce_sum.202 = f32[]{:T(128)} parameter(0), metadata={op_name="jit(train_step)/reduce_sum"}
  %reduce_sum.203 = f32[]{:T(128)} parameter(1), metadata={op_name="jit(train_step)/reduce_sum"}
  ROOT %reduce_sum.207 = f32[]{:T(128)} add(%reduce_sum.202, %reduce_sum.203), metadata={op_name="jit(train_step)/reduce_sum" stack_frame_id=0}, backend_config={"flag_configs":[],"scoped_memory_configs":[],"used_scoped_memory_configs":[],"aliasing_operands":{"lists":[]}}
}

%region_23.28 (reduce_sum.196: f32[], reduce_sum.200: f32[]) -> f32[] {
  %reduce_sum.196 = f32[]{:T(128)} parameter(0), metadata={op_name="jit(train_step)/reduce_sum"}
  %reduce_sum.200 = f32[]{:T(128)} parameter(1), metadata={op_name="jit(train_step)/reduce_sum"}
  ROOT %reduce_sum.201 = f32[]{:T(128)} add(%reduce_sum.196, %reduce_sum.200), metadata={op_name="jit(train_step)/reduce_sum" stack_frame_id=0}, backend_config={"flag_configs":[],"scoped_memory_configs":[],"used_scoped_memory_configs":[],"aliasing_operands":{"lists":[]}}
}

%fused_computation.241 (param_0.1132: f32[4,4096,14336], param_1.1288: f32[4,4096,14336]) -> (f32[], f32[]) {
  %param_0.1132 = f32[4,4096,14336]{2,0,1:T(4,128)} parameter(0)
  %bitcast.318 = f32[4096,4,14336]{2,1,0:T(4,128)} bitcast(%param_0.1132), metadata={op_name="jit(train_step)/transpose(jvp(TransformerLinenPure.apply))/TransformerLinenPure/decoder/transpose" stack_frame_id=0}
  %square.167 = f32[4096,4,14336]{2,1,0:T(4,128)} multiply(%bitcast.318, %bitcast.318), metadata={op_name="jit(train_step)/square" stack_frame_id=0}
  %constant.1004 = f32[]{:T(128)} constant(0)
  %reduce.86 = f32[]{:T(128)} reduce(%square.167, %constant.1004), dimensions={0,1,2}, to_apply=%region_24.29, metadata={op_name="jit(train_step)/reduce_sum" stack_frame_id=0}
  %param_1.1288 = f32[4,4096,14336]{2,0,1:T(4,128)} parameter(1)
  %bitcast.322.clone.1 = f32[4096,4,14336]{2,1,0:T(4,128)} bitcast(%param_1.1288), metadata={op_name="jit(train_step)/transpose(jvp(TransformerLinenPure.apply))/TransformerLinenPure/decoder/transpose" stack_frame_id=0}
  %square.170.clone.1 = f32[4096,4,14336]{2,1,0:T(4,128)} multiply(%bitcast.322.clone.1, %bitcast.322.clone.1), metadata={op_name="jit(train_step)/square" stack_frame_id=0}
  %reduce.87.clone.1 = f32[]{:T(128)} reduce(%square.170.clone.1, %constant.1004), dimensions={0,1,2}, to_apply=%region_23.28, metadata={op_name="jit(train_step)/reduce_sum" stack_frame_id=0}
  ROOT %tuple.155 = (f32[]{:T(128)}, f32[]{:T(128)}) tuple(%reduce.86, %reduce.87.clone.1)
}

%fused_computation.244 (param_0.699: f32[14336,4,4096]) -> bf16[4,14336,4096] {
  %param_0.699 = f32[14336,4,4096]{2,1,0:T(4,128)} parameter(0)
  %copy.234 = bf16[14336,4,4096]{2,0,1:T(8,128)(2,1)} copy(%param_0.699), sharding={replicated}, metadata={op_name="state.params[\'params\'][\'decoder\'][\'layers\'][\'mlp\'][\'wo\'][\'kernel\']"}
  ROOT %bitcast.323 = bf16[4,14336,4096]{2,1,0:T(8,128)(2,1)} bitcast(%copy.234), metadata={op_name="jit(train_step)/jvp(TransformerLinenPure.apply)/TransformerLinenPure/decoder/transpose" stack_frame_id=0}
}

%fused_computation.245 (param_0.701: f32[4096,4,14336]) -> bf16[4,4096,14336] {
  %param_0.701 = f32[4096,4,14336]{2,1,0:T(4,128)} parameter(0)
  %copy.235 = bf16[4096,4,14336]{2,0,1:T(8,128)(2,1)} copy(%param_0.701), sharding={replicated}, metadata={op_name="state.params[\'params\'][\'decoder\'][\'layers\'][\'mlp\'][\'wi_1\'][\'kernel\']"}
  ROOT %bitcast.324 = bf16[4,4096,14336]{2,1,0:T(8,128)(2,1)} bitcast(%copy.235), metadata={op_name="jit(train_step)/jvp(TransformerLinenPure.apply)/TransformerLinenPure/decoder/transpose" stack_frame_id=0}
}

%fused_computation.246 (param_0.703: f32[4096,4,14336]) -> bf16[4,4096,14336] {
  %param_0.703 = f32[4096,4,14336]{2,1,0:T(4,128)} parameter(0)
  %copy.236 = bf16[4096,4,14336]{2,0,1:T(8,128)(2,1)} copy(%param_0.703), sharding={replicated}, metadata={op_name="state.params[\'params\'][\'decoder\'][\'layers\'][\'mlp\'][\'wi_0\'][\'kernel\']"}
  ROOT %bitcast.325 = bf16[4,4096,14336]{2,1,0:T(8,128)(2,1)} bitcast(%copy.236), metadata={op_name="jit(train_step)/jvp(TransformerLinenPure.apply)/TransformerLinenPure/decoder/transpose" stack_frame_id=0}
}

%region_52.57 (reduce_sum.343: f32[], reduce_sum.347: f32[]) -> f32[] {
  %reduce_sum.343 = f32[]{:T(128)} parameter(0), metadata={op_name="jit(train_step)/reduce_sum"}
  %reduce_sum.347 = f32[]{:T(128)} parameter(1), metadata={op_name="jit(train_step)/reduce_sum"}
  ROOT %reduce_sum.348 = f32[]{:T(128)} add(%reduce_sum.343, %reduce_sum.347), metadata={op_name="jit(train_step)/reduce_sum" stack_frame_id=0}, backend_config={"flag_configs":[],"scoped_memory_configs":[],"used_scoped_memory_configs":[],"aliasing_operands":{"lists":[]}}
}

%region_38.43 (reduce_sum.271: f32[], reduce_sum.272: f32[]) -> f32[] {
  %reduce_sum.271 = f32[]{:T(128)} parameter(0), metadata={op_name="jit(train_step)/reduce_sum"}
  %reduce_sum.272 = f32[]{:T(128)} parameter(1), metadata={op_name="jit(train_step)/reduce_sum"}
  ROOT %reduce_sum.273 = f32[]{:T(128)} add(%reduce_sum.271, %reduce_sum.272), metadata={op_name="jit(train_step)/reduce_sum" stack_frame_id=0}, backend_config={"flag_configs":[],"scoped_memory_configs":[],"used_scoped_memory_configs":[],"aliasing_operands":{"lists":[]}}
}

%fused_computation.247 (param_0.1121: f32[14336,4,4096], param_1.1281: f32[], param_2.1102: f32[], param_3.785: f32[], param_4.492: f32[14336,4,4096], param_5.423: f32[], param_6.296: f32[4,14336,4096], param_7.194: pred[], param_8.112: f32[14336,4,4096]) -> (f32[], f32[14336,4,4096], f32[14336,4,4096], f32[14336,4,4096], f32[]) {
  %param_0.1121 = f32[14336,4,4096]{2,1,0:T(4,128)} parameter(0)
  %param_3.785 = f32[]{:T(128)S(6)} parameter(3)
  %mul.1868.clone.1 = f32[14336,4,4096]{2,1,0:T(4,128)} broadcast(%param_3.785), dimensions={}, metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %param_7.194 = pred[]{:T(512)S(6)} parameter(7)
  %select_n.274.clone.1 = pred[14336,4,4096]{2,1,0:T(4,128)(4,1)} broadcast(%param_7.194), dimensions={}, metadata={op_name="jit(train_step)/select_n" stack_frame_id=0}
  %param_6.296 = f32[4,14336,4096]{2,0,1:T(4,128)} parameter(6)
  %bitcast.423.clone.1 = f32[14336,4,4096]{2,1,0:T(4,128)} bitcast(%param_6.296), metadata={op_name="jit(train_step)/transpose(jvp(TransformerLinenPure.apply))/TransformerLinenPure/decoder/transpose" stack_frame_id=0}
  %param_5.423 = f32[]{:T(128)} parameter(5)
  %div.789.clone.1 = f32[14336,4,4096]{2,1,0:T(4,128)} broadcast(%param_5.423), dimensions={}, metadata={op_name="jit(train_step)/div" stack_frame_id=0}
  %div.788.clone.1 = f32[14336,4,4096]{2,1,0:T(4,128)} divide(%bitcast.423.clone.1, %div.789.clone.1), metadata={op_name="jit(train_step)/div" stack_frame_id=0}
  %select_n.273.clone.1 = f32[14336,4,4096]{2,1,0:T(4,128)} select(%select_n.274.clone.1, %bitcast.423.clone.1, %div.788.clone.1), metadata={op_name="jit(train_step)/select_n" stack_frame_id=0}
  %constant.947.clone.1 = f32[]{:T(128)} constant(0.1)
  %broadcast.547.clone.1 = f32[14336,4,4096]{2,1,0:T(4,128)} broadcast(%constant.947.clone.1), dimensions={}, metadata={op_name="broadcast.69"}
  %mul.1874.clone.1 = f32[14336,4,4096]{2,1,0:T(4,128)} multiply(%select_n.273.clone.1, %broadcast.547.clone.1), metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %param_8.112 = f32[14336,4,4096]{2,1,0:T(4,128)} parameter(8)
  %constant.951.clone.1 = f32[]{:T(128)} constant(0.9)
  %mul.1875.clone.1 = f32[14336,4,4096]{2,1,0:T(4,128)} broadcast(%constant.951.clone.1), dimensions={}, metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %mul.1873.clone.1 = f32[14336,4,4096]{2,1,0:T(4,128)} multiply(%param_8.112, %mul.1875.clone.1), metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %add.806.clone.1 = f32[14336,4,4096]{2,1,0:T(4,128)} add(%mul.1874.clone.1, %mul.1873.clone.1), metadata={op_name="jit(train_step)/add" stack_frame_id=0}
  %param_2.1102 = f32[]{:T(128)S(6)} parameter(2)
  %div.785.clone.1 = f32[14336,4,4096]{2,1,0:T(4,128)} broadcast(%param_2.1102), dimensions={}, metadata={op_name="jit(train_step)/div" stack_frame_id=0}
  %integer_pow.68.clone.1 = f32[14336,4,4096]{2,1,0:T(4,128)} multiply(%select_n.273.clone.1, %select_n.273.clone.1), metadata={op_name="jit(train_step)/integer_pow" stack_frame_id=0}
  %constant.950.clone.1 = f32[]{:T(128)} constant(0.05)
  %mul.1872.clone.1 = f32[14336,4,4096]{2,1,0:T(4,128)} broadcast(%constant.950.clone.1), dimensions={}, metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %mul.1870.clone.1 = f32[14336,4,4096]{2,1,0:T(4,128)} multiply(%integer_pow.68.clone.1, %mul.1872.clone.1), metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %param_4.492 = f32[14336,4,4096]{2,1,0:T(4,128)} parameter(4)
  %constant.949.clone.1 = f32[]{:T(128)} constant(0.95)
  %mul.1871.clone.1 = f32[14336,4,4096]{2,1,0:T(4,128)} broadcast(%constant.949.clone.1), dimensions={}, metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %mul.1869.clone.1 = f32[14336,4,4096]{2,1,0:T(4,128)} multiply(%param_4.492, %mul.1871.clone.1), metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %add.805.clone.1 = f32[14336,4,4096]{2,1,0:T(4,128)} add(%mul.1870.clone.1, %mul.1869.clone.1), metadata={op_name="jit(train_step)/add" stack_frame_id=0}
  %param_1.1281 = f32[]{:T(128)S(6)} parameter(1)
  %div.784.clone.1 = f32[14336,4,4096]{2,1,0:T(4,128)} broadcast(%param_1.1281), dimensions={}, metadata={op_name="jit(train_step)/div" stack_frame_id=0}
  %div.783.clone.1 = f32[14336,4,4096]{2,1,0:T(4,128)} divide(%add.805.clone.1, %div.784.clone.1), metadata={op_name="jit(train_step)/div" stack_frame_id=0}
  %sqrt.66.clone.1 = f32[14336,4,4096]{2,1,0:T(4,128)} sqrt(%div.783.clone.1), metadata={op_name="jit(train_step)/sqrt" stack_frame_id=0}
  %constant.948.clone.1 = f32[]{:T(128)} constant(1e-08)
  %add.804.clone.1 = f32[14336,4,4096]{2,1,0:T(4,128)} broadcast(%constant.948.clone.1), dimensions={}, metadata={op_name="jit(train_step)/add" stack_frame_id=0}
  %add.803.clone.1 = f32[14336,4,4096]{2,1,0:T(4,128)} add(%sqrt.66.clone.1, %add.804.clone.1), metadata={op_name="jit(train_step)/add" stack_frame_id=0}
  %multiply.191.clone.1 = f32[14336,4,4096]{2,1,0:T(4,128)} multiply(%div.785.clone.1, %add.803.clone.1), metadata={op_name="multiply.25"}
  %div.782.clone.1 = f32[14336,4,4096]{2,1,0:T(4,128)} divide(%add.806.clone.1, %multiply.191.clone.1), metadata={op_name="jit(train_step)/div" stack_frame_id=0}
  %mul.1867.clone.1 = f32[14336,4,4096]{2,1,0:T(4,128)} multiply(%param_0.1121, %broadcast.547.clone.1), metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %add.802.clone.1 = f32[14336,4,4096]{2,1,0:T(4,128)} add(%div.782.clone.1, %mul.1867.clone.1), metadata={op_name="jit(train_step)/add" stack_frame_id=0}
  %mul.1866.clone.1 = f32[14336,4,4096]{2,1,0:T(4,128)} multiply(%mul.1868.clone.1, %add.802.clone.1), metadata={op_name="jit(train_step)/mul" stack_frame_id=0}
  %add.801.clone.1 = f32[14336,4,4096]{2,1,0:T(4,128)} add(%param_0.1121, %mul.1866.clone.1), metadata={op_name="jit(train_step)/add" stack_frame_id=0}
  %square.171 = f32[14336,4,4096]{2,1,0:T(4,128)} multiply(%add.801.clone.1, %add.801.clone.1), metadata={op_name="jit(train_step)/square" stack_frame_id=0}
  %constant.993 = f32[]{:T(128)} constant(0)
  %reduce.88 = f32[]{:T(128)} reduce(%square.171, %constant.993), dimensions={0,1,2}, to_apply=%region_52.57, metadata={op_name="jit(train_step)/reduce_sum" stack_frame_id=0}
  %reduce.91.clone.1 = f32[]{:T(128)} reduce(%integer_pow.68.clone.1, %constant.993), dimensions={0,1,2}, to_apply=%region_38.43, metadata={op_name="jit(train_step)/reduce_sum" stack_frame_id=0}
  ROOT %tuple.137 = (f32[]{:T(128)}, f32[14336,4,4096]{2,1,0:T(4,128)}, f32[14336,4,4096]{2,1,0:T(4,128)}, f32[14336,4,4096]{2,1,0:T(4,128)}, f32[]{:T(128)}) tuple(%reduce.88, %add.801.clone.1, %add.805.clone.1, %add.806.clone.1, %reduce.91.clone.1)
}

%region_51.56 (reduce_sum.340: f32[], reduce_sum.341: f32[]) -> f32[] {
  %reduce_sum.340 = f32[]{:T(128)} parameter(0), metadata={op_name="jit(train_step)/reduce_sum"}
  %reduce_sum.341 = f32[]{:T(128)} parameter(1), metadata={op_name="jit(train_step)/reduce_sum"}
  ROOT %reduce_sum.342 = f32[]{:T(128)} add(%reduce_sum.340, %reduce_sum.341), metadata={op_name="jit(train_step)/reduce_sum" stack_frame_id=0}, backend_config={"flag_configs":[],"scoped_memory_configs":[],"used_scoped_memory_configs":[],"aliasing_operands":{"lists":[]}}
}

%region_37.42 (reduce_sum.265: f32[], reduce_sum.266: f32[]) -> f32[] {
  %reduce_sum.265 = f32[]{:T(128)} parameter(0), metadata={op_name="jit(train_step)/reduce_sum"}
  %reduce_sum.266 = f32[]{:T(128)} parameter(1), metadata={op_name="jit(train_step)/reduce_sum"}
  ROOT %reduce_sum.270 = f32[]{:T(128)} add(%reduce_sum.265, %reduce_sum.266), metadata={op_name="jit(train_step)/reduce_sum" stack_frame_id=0}, backend_config={"flag_configs":[],"scoped_memory_configs":[],"used_scoped_memory_configs":[],"aliasing_operands":{"lists":[]}}
}

%fused_computation.248 (param_0.1122: f32[4096,4,14336], param_1.1282: f32[], param_2.1103: f32[], param_3.786: f32[], param_4.493: f32[4096,4,14336], param_5.424: f32[], param_6.297: f32[4,4096,14336], param_7.195: pred[], param_8.113: f32[4096,4,14336]) -> (f32[], f32[4096,4,14336], f32[4096,4,14336], f32[4096,4,14336], f32[]) {
  %param_0.1122 = f32[4096,4,14336]{2,1,0:T(4,128)} parameter(0)
